{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Access | Password Reset",
    "1": "Access | Login Failure",
    "2": "Access | Access Request",
    "3": "Software | Software Install",
    "4": "Software | Data Loss",
    "5": "Hardware | Overheating",
    "6": "Access | Permission Issue",
    "7": "Hardware | Hardware Failure",
    "8": "Network | DNS Problem",
    "9": "Software | Application Crash",
    "10": "Network | Internet Slow",
    "11": "Hardware | Keyboard/Mouse",
    "12": "Network | Remote Access",
    "13": "Access | MFA Problem",
    "14": "Software | Update Problem",
    "15": "Hardware | Laptop Issue",
    "16": "Software | Compatibility",
    "17": "Software | Configuration",
    "18": "Network | VPN Connection",
    "19": "Access | Account Expired",
    "20": "Network | WiFi Issue",
    "21": "Hardware | Battery Issue",
    "22": "Network | Firewall Block",
    "23": "Access | Role Change",
    "24": "Network | Proxy Error",
    "25": "Access | Account Unlock",
    "26": "Software | License Issue",
    "27": "Hardware | Blue Screen",
    "28": "Hardware | Monitor Problem",
    "29": "Hardware | Printer Error",
    "30": "Software | Performance",
    "31": "Network | Network Drive"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Access | Access Request": 2,
    "Access | Account Expired": 19,
    "Access | Account Unlock": 25,
    "Access | Login Failure": 1,
    "Access | MFA Problem": 13,
    "Access | Password Reset": 0,
    "Access | Permission Issue": 6,
    "Access | Role Change": 23,
    "Hardware | Battery Issue": 21,
    "Hardware | Blue Screen": 27,
    "Hardware | Hardware Failure": 7,
    "Hardware | Keyboard/Mouse": 11,
    "Hardware | Laptop Issue": 15,
    "Hardware | Monitor Problem": 28,
    "Hardware | Overheating": 5,
    "Hardware | Printer Error": 29,
    "Network | DNS Problem": 8,
    "Network | Firewall Block": 22,
    "Network | Internet Slow": 10,
    "Network | Network Drive": 31,
    "Network | Proxy Error": 24,
    "Network | Remote Access": 12,
    "Network | VPN Connection": 18,
    "Network | WiFi Issue": 20,
    "Software | Application Crash": 9,
    "Software | Compatibility": 16,
    "Software | Configuration": 17,
    "Software | Data Loss": 4,
    "Software | License Issue": 26,
    "Software | Performance": 30,
    "Software | Software Install": 3,
    "Software | Update Problem": 14
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
